fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Реквизит доработки ВКМ. Заполняется для договоров вида «Абонентское обслуживание».</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ДобавитьЭлементыАбонентскогоОбслуживания();
	ВКМ_УстановитьВидимостьРеквизитовДоговора(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик события "ПриИзменении" поля "ВидДоговора".
// Подключается программно в процедуре ВКМ_ДобавитьЭлементыАбонентскогоОбслуживания.
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором изменено значение.
//
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	ВКМ_УстановитьВидимостьРеквизитовДоговора(ЭтотОбъект);
	
КонецПроцедуры

// Программно добавляет на форму группу и поля реквизитов, которые используются
// только в договорах вида "Абонентское обслуживание", и подключает обработчик
// события "ПриИзменении" к полю вида договора.
//
&НаСервере
Процедура ВКМ_ДобавитьЭлементыАбонентскогоОбслуживания()
	
	Группа = Элементы.Добавить("ВКМ_ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.Заголовок = НСтр("ru = 'Условия абонентского обслуживания'");
	
	ВКМ_ДобавитьПолеФормы("ВКМ_ДатаНачала", "Объект.ВКМ_ДатаНачала", Группа);
	ВКМ_ДобавитьПолеФормы("ВКМ_ДатаОкончания", "Объект.ВКМ_ДатаОкончания", Группа);
	ВКМ_ДобавитьПолеФормы("ВКМ_СуммаАбонентскойПлаты", "Объект.ВКМ_СуммаАбонентскойПлаты", Группа);
	ВКМ_ДобавитьПолеФормы("ВКМ_СтоимостьЧасаРаботы", "Объект.ВКМ_СтоимостьЧасаРаботы", Группа);
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВКМ_ВидДоговораПриИзменении");
	
КонецПроцедуры

// Добавляет на форму поле ввода, связанное с реквизитом объекта.
//
// Параметры:
//  Имя      - Строка       - имя создаваемого элемента формы.
//  Путь     - Строка       - путь к данным реквизита, например "Объект.ВКМ_ДатаНачала".
//  Родитель - ГруппаФормы  - группа, в которую помещается создаваемое поле.
//
&НаСервере
Процедура ВКМ_ДобавитьПолеФормы(Имя, Путь, Родитель)
	
	Поле = Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = Путь;
	
КонецПроцедуры

// Управляет видимостью реквизитов, относящихся к абонентскому обслуживанию.
// Реквизиты отображаются только для договоров соответствующего вида.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента справочника "Договоры контрагентов".
//
&НаКлиентеНаСервереБезКонтекста
Процедура ВКМ_УстановитьВидимостьРеквизитовДоговора(Форма)
	
	ЭтоАбонентскийДоговор = (Форма.Объект.ВидДоговора
		= ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	
	Форма.Элементы.ВКМ_ГруппаАбонентскоеОбслуживание.Видимость = ЭтоАбонентскийДоговор;
	
КонецПроцедуры

#КонецОбласти
